LonelyWolf/stm32/stm32l151rdt6-dev/main.c
			BEEPER_Enable(200,1);
		} else {
			// Button pressed
			button->hold_cntr = 0;
			button->state = BTN_Pressed;
			BEEPER_Enable(2000,1);
		}
	} else {
		if (button->PORT->IDR & button->PIN) {
		    // Button released
			button->hold_cntr = 0;
			if (button->state != BTN_Hold) button->cntr++;
			button->state = BTN_Released;

			// Disable sleep-on-exit (return to main loop from IRQ)
			SCB->SCR &= ~SCB_SCR_SLEEPONEXIT_Msk;

			BEEPER_Enable(200,1);
		} else {
			// Button pressed
			button->hold_cntr = 0;
			button->state = BTN_Pressed;
			BEEPER_Enable(2000,1);
		}
	}
}

// RTC wake-up IRQ handler
void RTC_WKUP_IRQHandler(void) {
	if (RTC->ISR & RTC_ISR_WUTF) {
		// RTC Wake-up interrupt

		// Get current date/time
		RTC_GetDateTime(&_time,&_date);

		// Disable sleep-on-exit (return to main loop from IRQ)
		SCB->SCR &= ~SCB_SCR_SLEEPONEXIT_Msk;

		PWR->CR  |= PWR_CR_DBP; // Access to RTC, RTC Backup and RCC CSR registers enabled
		RTC->ISR &= ~RTC_ISR_WUTF; // Clear the RTC wake-up timer flag
		PWR->CR  &= ~PWR_CR_DBP; // Access to RTC, RTC Backup and RCC CSR registers disabled

		EXTI->PR = RTC_EXTI_LINE;
	}
}

// EXTI0 line IRQ handler
void EXTI0_IRQHandler(void) {
	if (EXTI->PR & BTN3_EXTI) {
		// EXTI0 (Button#3 -> "ESCAPE")
		Button_Inquiry(&BTN[BTN_ESCAPE]);
		EXTI->PR = BTN3_EXTI; // Clear IT bit for EXTI_line
	}
}

// EXTI1 line IRQ handler
void EXTI1_IRQHandler(void) {
	nRF24_RX_PCKT_TypeDef RX_status;

	if (EXTI->PR & nRF24_IRQ_EXTI) {
		RX_status = nRF24_RXPacket(nRF24_RX_Buf,nRF24_RX_PAYLOAD);
		if (RX_status == nRF24_RX_PCKT_PIPE0) {
			_packets_rcvd++;
			_new_packet = TRUE;
		}

//		BEEPER_Enable(700,2);

		// Disable sleep-on-exit (return to main loop from IRQ)
		SCB->SCR &= ~SCB_SCR_SLEEPONEXIT_Msk;

		// Clear IT bit for EXTI_Line
		EXTI->PR = nRF24_IRQ_EXTI;
	}
}

// EXTI3 line IRQ handler
void EXTI3_IRQHandler(void) {
	if (EXTI->PR & SD_DETECT_EXTI) {
		_SD_int_cntr++;
		_SD_connected = (SD_DETECT_PORT->IDR & SD_DETECT_PIN) ? 0 : 1;
		if (_SD_connected) {
			BEEPER_PlayTones(tones_USB_con);
		} else {
			BEEPER_PlayTones(tones_USB_dis);
		}

		// Clear IT bit for EXTI_Line
		EXTI->PR = SD_DETECT_EXTI;
	}
}

// EXTI[10..15] lines IRQ handler
void EXTI15_10_IRQHandler(void) {
	uint16_t acc_irq;

/*
	// EXTI10 of USB sense conflicts with EXTI10 of button "UP"
	if (EXTI->PR & USB_SENS_EXTI) {
		// USB sense pin
		_USB_int_cntr++;
		_USB_connected = (USB_SENS_PORT->IDR & USB_SENS_PIN) ? 1 : 0;
		if (_USB_connected) {
			BEEPER_PlayTones(tones_USB_con);
		} else {
			BEEPER_PlayTones(tones_USB_dis);
		}
		EXTI->PR = USB_SENS_EXTI; // Clear IT bit for EXTI_Line
	}
*/

	if (EXTI->PR & ACC_IRQ_EXTI) {
		// Accelerometer IRQ pin
		acc_irq = BMC050_ACC_GetIRQStatus(); // <--- Bad idea to call this in IRQ handler
		if (acc_irq & ACC_IRQ_SLOPE) {
			// Slope IRQ high
			BEEPER_Enable(444,1);
		} else {
			// Slope IRQ low
			BEEPER_Enable(3333,1);
		}
		EXTI->PR = ACC_IRQ_EXTI; // Clear IT bit for EXTI_line
	}

	if (EXTI->PR & BTN0_EXTI) {
		// EXTI10 (Button#0 -> "UP")
		Button_Inquiry(&BTN[BTN_UP]);
		EXTI->PR = BTN0_EXTI; // Clear IT bit for EXTI_line
	}

	if (EXTI->PR & BTN1_EXTI) {
		// EXTI11 (Button#1 -> "DOWN")
		Button_Inquiry(&BTN[BTN_DOWN]);
		EXTI->PR = BTN1_EXTI; // Clear IT bit for EXTI_line
	}

	if (EXTI->PR & BTN2_EXTI) {
		// EXTI15 (Button#2 -> "ENTER")
		Button_Inquiry(&BTN[BTN_ENTER]);
		EXTI->PR = BTN2_EXTI; // Clear IT bit for EXTI_line
	}
}

// SDIO IRQ handler
void SDIO_IRQHandler(void) {
	printf("\r\n###> IRQ SDIO [%X] CNT=%u\r\n",SDIO->STA,SDIO->FIFOCNT);

	// Clear SDIO interrupt bit
//	SDIO->ICR = 0x00FFFFFF;
	SDIO->ICR = SDIO_ICR_TXUNDERRC;
}

// DMA2 channel4 IRQ handler (SDIO DMA)
void DMA2_Channel4_IRQHandler(void) {
	uint32_t cntr;

	cntr = SDIO_DMA_CH->CNDTR;
	printf("\r\n###> IRQ DMA2 [%X] [%u]\r\n",DMA2->ISR,cntr);

	// Clear DMA interrupt bits
	DMA2->IFCR = DMA_IFCR_CGIF4 | DMA_IFCR_CHTIF4 | DMA_IFCR_CTCIF4 | DMA_IFCR_CTEIF4;
}

// Compute interquartile mean from array of values
uint32_t InterquartileMean(uint16_t *array, uint32_t numOfSamples) {
	uint32_t sum=0;
	uint32_t index, maxindex;

	// discard the lowest and the highest data samples
	maxindex = 3 * numOfSamples / 4;
	for (index = (numOfSamples / 4); index < maxindex; index++) {
		sum += array[index];
	}
	// return the mean value of the remaining samples value

	return (sum / (numOfSamples / 2));
}




int main(void) {
	// Determine wake-up source
	_reset_source = GetResetSource();




	// Just for fun...
	// If wake-up was from RTC then do BEEP and go back STANDBY mode
	// If wake-up was from WKUP2 pin (accelerometer IRQ) then do BEEP, wait while IRQ asserted
	//                     do another BEEP and go back STANBY mode
	// If wake-up was from WKUP1 pin (ESCAPE button), then skip this and go to normal operation
	if ((_reset_source & RESET_SRC_STBY) && !(_reset_source & RESET_SRC_STBY_WP1)) {
		// At this time the MSI clock is used as system clock (~2.097MHz)
		// Rise it up to ~4.194MHz to do proper beep
		i = (RCC->ICSCR & ~RCC_ICSCR_MSIRANGE); // Clear MSIRANGE bits
		RCC->ICSCR = i | RCC_ICSCR_MSIRANGE_6; // Set MSI range 6 (around 4.194MHz)

		// Enable the PWR peripheral to deal with it CSR register
		RCC->APB1ENR |= RCC_APB1ENR_PWREN;

		// Compute the actual MCU clock speed (for proper BEEPER initialization)
		SystemCoreClockUpdate();

		// Initialize BEEPER and do BEEP to indicate what MCU is awake
		BEEPER_Init();

		if (_reset_source & RESET_SRC_STBY_WP2) {
			// Initialize BEEPER and do BEEP to indicate what MCU is awake
//			BEEPER_Init();

			// This is wake-up from accelerometer IRQ pin
			BEEPER_Enable(2222,2);

			// Enable the accelerometer IRQ GPIO pin and wait until it becomes low
			RCC->AHBENR |= ACC_IRQ_PERIPH; // Enable GPIO port peripheral
			ACC_IRQ_PORT->MODER &= ~GPIO_MODER_MODER13; // Input mode (reset state)
			ACC_IRQ_PORT->PUPDR &= ~GPIO_PUPDR_PUPDR13; // Floating (clear bits)
			while (ACC_IRQ_PORT->IDR & ACC_IRQ_PIN);

			// Do another BEEP and wait till it ends
			BEEPER_Enable(444,1);
			while (_beep_duration);
		} else {
			// Clear the RTC wake-up timer flag
			// The PWR peripheral must be enabled (in GetResetSource)
			PWR->CR  |= PWR_CR_DBP; // Access to RTC, RTC Backup and RCC CSR registers enabled
			RTC->ISR &= ~RTC_ISR_WUTF;
			PWR->CR  &= ~PWR_CR_DBP; // Access to RTC, RTC Backup and RCC CSR registers disabled

