LonelyWolf/stm32/stm32l151rdt6-dev/main.c
	// PA15 as source input for EXTI15
	SYSCFG->EXTICR[3] &= ~SYSCFG_EXTICR4_EXTI15; // Clear bits (Set PA15 pin as input source)
	// In fact this is not necessary because it is the default condition after reset
	SYSCFG->EXTICR[3] |=  SYSCFG_EXTICR4_EXTI15_PA; // Set PA15 pin as input source

	// Button#3
	EXTI->PR    =  BTN3_EXTI; // Clear IT pending bit for EXTI
	EXTI->IMR  |=  BTN3_EXTI; // Enable interrupt request from EXTI
	EXTI->EMR  &= ~BTN3_EXTI; // Disable event on EXTI
	EXTI->RTSR |=  BTN3_EXTI; // Trigger rising edge enabled
	EXTI->FTSR |=  BTN3_EXTI; // Trigger falling edge enabled

	// PA0 as source input for EXTI0
	SYSCFG->EXTICR[0] &= ~SYSCFG_EXTICR1_EXTI0; // Clear bits (Set PA0 pin as input source)
	// In fact this is not necessary because it is the default condition after reset
	SYSCFG->EXTICR[0] |=  SYSCFG_EXTICR1_EXTI0_PA; // Set PA0 pin as input source

	// Simple enable the button pins interrupts
	NVIC_EnableIRQ(BTN0_EXTI_N);
	NVIC_EnableIRQ(BTN1_EXTI_N);
	NVIC_EnableIRQ(BTN2_EXTI_N);
	NVIC_EnableIRQ(BTN3_EXTI_N);




	// For debug purposes
	if (CoreDebug->DHCSR & CoreDebug_DHCSR_C_DEBUGEN_Msk) {
		// Application executed under debugger control
		BEEPER_Enable(333,3);
		Delay_ms(500);
	} else {
		if (_reset_source & RESET_SRC_STBY) {
			// Device has been in STANDBY mode
			BEEPER_Enable(4000,3);
		} else {
			// Device has not been in STANDBY mode
			BEEPER_Enable(1000,3);
		}
		Delay_ms(2000);
	}




	// Reset or wake-up source
	if (_reset_source == RESET_SRC_UNKNOWN) {
		printf("Wakeup: [UNKNOWN]\r\n");
	} else {
		printf("Wakeup: %s%s%s%s%s%s\r\n",
				_reset_source & RESET_SRC_PIN      ? "PIN " : "",
				_reset_source & RESET_SRC_POR      ? "POR/PDR " : "",
				_reset_source & RESET_SRC_SOFT     ? "SOFT " : "",
				_reset_source & RESET_SRC_STBY     ? "STBY " : "",
				_reset_source & RESET_SRC_STBY_WP1 ? "WKUP1 " : "",
				_reset_source & RESET_SRC_STBY_WP2 ? "WKUP2 " : ""
				);
	}




	// System core clock
	i = SystemCoreClock;
	printf("CPU: %u.%03uMHz\r\n",i / 1000000,(i / 1000) % 1000);
/*
	RCC_ClocksTypeDef RCC_Clocks;
	RCC_GetClocksFreq(&RCC_Clocks);
	printf("RCC: HCLK=%u PCLK1=%u PCLK2=%u SYSCLK=%u\r\n",
			RCC_Clocks.HCLK_Frequency,
			RCC_Clocks.PCLK1_Frequency,
			RCC_Clocks.PCLK2_Frequency,
			RCC_Clocks.SYSCLK_Frequency);
*/




	// Debugger report
	printf("Core debugger: %s\r\n",(CoreDebug->DHCSR & CoreDebug_DHCSR_C_DEBUGEN_Msk) ? "PRESENT" : "NONE");




	// Configure charger STAT pin
	RCC->AHBENR |= CHRG_STAT_PERIPH; // Enable charger STAT pin port peripheral

	// Configure GPIO pin as input with pull-up
	CHRG_STAT_PORT->MODER &= ~GPIO_MODER_MODER2; // Input mode (reset state)
	CHRG_STAT_PORT->PUPDR &= ~GPIO_PUPDR_PUPDR2; // Floating (clear bits)
	CHRG_STAT_PORT->PUPDR |=  GPIO_PUPDR_PUPDR2_0; // Pull-up




	// Configure SD detect pin
	RCC->AHBENR |= SD_DETECT_PERIPH; // Enable SD detect pin port peripheral

	// ------------ WARNING -------------
	// PB3 mapped as JTDO after reset, it must be switched to GPIO function here!
	// ------------ WARNING -------------

	/////////////////////////////////////////////////////////////////////////////////////////////
	// To use the serial wire DP to release some GPIOs, the user software must change the GPIO //
	// (PA15, PB3 and PB4) configuration mode in the GPIO_MODER register. This releases        //
	// PA15, PB3 and PB4 which now become available as GPIOs.                                  //
	/////////////////////////////////////////////////////////////////////////////////////////////

	// Configure GPIO pin as input with pull-up
	SD_DETECT_PORT->MODER &= ~GPIO_MODER_MODER3; // Input mode (reset state)
	SD_DETECT_PORT->PUPDR &= ~GPIO_PUPDR_PUPDR3; // Floating (clear bits)

	// Configure the EXTI line (SD detect pin)
	EXTI->PR    =  SD_DETECT_EXTI; // Clear IT pending bit for EXTI
	EXTI->IMR  |=  SD_DETECT_EXTI; // Enable interrupt request from EXTI
	EXTI->EMR  &= ~SD_DETECT_EXTI; // Disable event on EXTI
	EXTI->RTSR |=  SD_DETECT_EXTI; // Trigger rising edge enabled
	EXTI->FTSR |=  SD_DETECT_EXTI; // Trigger falling edge enabled

	// PB3 as source input for EXTI3
	SYSCFG->EXTICR[0] &= ~SYSCFG_EXTICR1_EXTI3; // Clear bits (PA[x] pin as input source)
	SYSCFG->EXTICR[0] |=  SYSCFG_EXTICR1_EXTI3_PB; // Set PB[x] pin as input source

/*
	// Enable the SD detect pin interrupt
	NVICInit.NVIC_IRQChannel = SD_DETECT_EXTI_N;
	NVICInit.NVIC_IRQChannelPreemptionPriority = 2;
	NVICInit.NVIC_IRQChannelSubPriority = 0;
	NVICInit.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVICInit);
*/

	// Simple enable the SD detect pin interrupt
	NVIC_EnableIRQ(SD_DETECT_EXTI_N);

	_SD_connected = (SD_DETECT_PORT->IDR & SD_DETECT_PIN) ? 0 : 1;




	// nRF24 SPI port initialization
	SPIx_Init(nRF24_SPI_PORT);
	SPIx_SetSpeed(nRF24_SPI_PORT,SPI_BR_2); // Highest speed (16MHz with 32MHz CPU)

	// Initialize and configure nRF24
	nRF24_Init();
	j = nRF24_Check();
	printf("nRF24L01+: %s\r\n",(j) ? "PRESENT" : "FAIL");

	// Dump nRF24L01+ registers
	if (j) {
		printf("nRF24L01+ registers:\r\n");
		for (i = 0; i < 0x1d; i++) {
			j = nRF24_ReadReg(i);
			printf("R%02X=0x%02X%s",i,j,((i + 1) % 8) ? " " : "\r\n");
		}

		// Configure nRF24 IRQ EXTI line
		EXTI->PR    =  nRF24_IRQ_EXTI; // Clear IT pending bit for EXTI
		EXTI->IMR  |=  nRF24_IRQ_EXTI; // Enable interrupt request from EXTI
		EXTI->EMR  &= ~nRF24_IRQ_EXTI; // Disable event on EXTI
		EXTI->RTSR &= ~nRF24_IRQ_EXTI; // Trigger rising edge disabled
		EXTI->FTSR |=  nRF24_IRQ_EXTI; // Trigger falling edge enabled

		// PB1 as source input for EXTI1
		SYSCFG->EXTICR[0] &= ~SYSCFG_EXTICR1_EXTI1; // Clear bits (PA[x] pin as input source)
		SYSCFG->EXTICR[0] |=  SYSCFG_EXTICR1_EXTI1_PB; // Set PB[x] pin as input source

/*
		// Enable the nRF24 IRQ pin interrupt
		NVICInit.NVIC_IRQChannel = nRF24_IRQ_EXTI_N;
		NVICInit.NVIC_IRQChannelPreemptionPriority = 2;
		NVICInit.NVIC_IRQChannelSubPriority = 0;
		NVICInit.NVIC_IRQChannelCmd = ENABLE;
		NVIC_Init(&NVICInit);
*/

		// Simple enable the nRF24 IRQ pin interrupt
		NVIC_EnableIRQ(nRF24_IRQ_EXTI_N);

		// Configure nRF24 receive mode
		nRF24_Wake();
#ifdef NRF24_SOLAR
		// Solar powered temperature sensor
		nRF24_RXMode(
				nRF24_RX_PIPE0,           // RX on PIPE#0
				nRF24_ENAA_P0,            // Auto acknowledgment enabled for PIPE#0
				nRF24_RF_CHANNEL,         // RF Channel
				nRF24_DataRate_1Mbps,     // Data rate
				nRF24_CRC_2byte,          // CRC scheme
				(uint8_t *)nRF24_RX_Addr, // RX address
				nRF24_RX_Addr_Size,       // RX address size
				nRF24_RX_PAYLOAD,         // Payload length
				nRF24_TXPower_0dBm        // TX power for auto acknowledgment
				);
#else
		// WBC
		nRF24_RXMode(
				nRF24_RX_PIPE0,           // RX on PIPE#0
				nRF24_ENAA_OFF,           // Auto acknowledgment
				nRF24_RF_CHANNEL,         // RF Channel
				nRF24_DataRate_250kbps,   // Data rate
				nRF24_CRC_2byte,          // CRC scheme
				(uint8_t *)nRF24_RX_Addr, // RX address
				nRF24_RX_Addr_Size,       // RX address size
				nRF24_RX_PAYLOAD,         // Payload length
				nRF24_TXPower_0dBm        // TX power for auto acknowledgment
				);
#endif
	    nRF24_ClearIRQFlags();
	    nRF24_FlushRX();

//	    nRF24_PowerDown();

	    printf("\r\n---------------------------------------------\r\n");
	}



///*
	// Check Vbat measurement

	// Enable the PORTA peripheral
	RCC->AHBENR |= RCC_AHBPeriph_GPIOA;

