LonelyWolf/stm32/stm32l151rdt6-dev/main.c
	// Configure PA1 as analog (for ADC_IN1)
	GPIOA->MODER |=  GPIO_MODER_MODER1; // Analog mode

	// Enable Vbat divider
	PWR_VBAT_ENABLE_H(); // Turn on

	// Initialize the HSI clock
	RCC->CR |= RCC_CR_HSION; // Enable HSI
	while (!(RCC->CR & RCC_CR_HSIRDY)); // Wait until HSI stable

	// Initialize the ADC
	RCC->APB2ENR |= RCC_APB2ENR_ADC1EN; // Enable the ADC1 peripheral clock
	ADC->CCR = ADC_CCR_TSVREFE; // Enable Vrefint and temperature sensor, ADC prescaler = HSI/1
	while(!(PWR->CSR & PWR_CSR_VREFINTRDYF)); // Wait until Vrefint stable

	// Configure the ADC
	ADC1->CR1 &= ~ADC_CR1_RES; // 12-bit resolution (Tconv = 12 ADCCLK cycles)
	ADC1->CR1 |= ADC_CR1_SCAN | ADC_CR1_PDI; // Scan mode, power down during the idle phase
	ADC1->CR2 &= ~ADC_CR2_ALIGN; // Right alignment

	// ADC channels sample rate
	ADC1->SMPR3 |= ADC_SMPR3_SMP1; // Channel 1: 384 cycles
	ADC1->SMPR2 |= ADC_SMPR2_SMP17; // Channel 17: 384 cycles

	// Injected sequence (2 conversions: first ADC_IN1, then ADC_IN17)
	ADC1->JSQR = ADC_JSQR_JL_0 | ADC_JSQR_JSQ3_0 | ADC_JSQR_JSQ4_0 | ADC_JSQR_JSQ4_4;

	// Enable the ADC
	ADC1->CR2 |= ADC_CR2_ADON;
	while (!(ADC1->SR & ADC_SR_ADONS)); // Wait until ADC is on
//*/




	// Initialize the I2C peripheral
	if (I2Cx_Init(I2C1,400000) != I2C_SUCCESS) {
		printf("I2C initialization failed\r\n");
	} else {
		// Check if I2C devices respond
		printf("I2C test:\r\n");
		printf("  ...ping TSL2581: %s\r\n",(I2Cx_IsDeviceReady(I2C1,TSL2581_ADDR,10) == I2C_SUCCESS) ? "OK" : "NO RESPOND");
		printf("  ...ping  BMP180: %s\r\n",(I2Cx_IsDeviceReady(I2C1,BMP180_ADDR,10) == I2C_SUCCESS) ? "OK" : "NO RESPOND");
		printf("  ...ping   FAKE1: %s\r\n",(I2Cx_IsDeviceReady(I2C1,0xCC,10) == I2C_SUCCESS) ? "OK" : "NO RESPOND");
		printf("  ...ping BMC050A: %s\r\n",(I2Cx_IsDeviceReady(I2C1,BMC050_ACC_ADDR,10) == I2C_SUCCESS) ? "OK" : "NO RESPOND");
		printf("  ...ping BMC050M: %s\r\n",(I2Cx_IsDeviceReady(I2C1,BMC050_MAG_ADDR,10) == I2C_SUCCESS) ? "OK" : "NO RESPOND");
		printf("  ...ping   FAKE2: %s\r\n",(I2Cx_IsDeviceReady(I2C1,0xDD,10) == I2C_SUCCESS) ? "OK" : "NO RESPOND");
	    printf("---------------------------------------------\r\n");
	}




	// Check the ALS
	printf("Ambient light sensor ");
	if (I2Cx_IsDeviceReady(I2C1,TSL2581_ADDR,10) == I2C_SUCCESS) {
		printf("ID: %02X\r\n",TSL2581_GetDeviceID());
		TSL2581_Init();
		TSL2581_SetGain(TSL2581_GAIN8);
		d0 = TSL2581_GetData0();
		d1 = TSL2581_GetData1();
//		TSL2581_PowerOff();
	} else {
		printf("FAIL\r\n");
	}




	// Check the BMP180
	printf("Pressure sensor ");
	if (I2Cx_IsDeviceReady(I2C1,BMP180_ADDR,10) == I2C_SUCCESS) {
		printf("ID: %02X\r\n",BMP180_GetVersion());
		BMP180_Reset(); // Send reset command to BMP180
		Delay_ms(15); // Wait for BMP180 startup time (10ms by datasheet)
		if (BMP180_Check() == BMP180_SUCCESS) {
			BMP180_ReadCalibration();
			BR = BMP180_GetReadings(&RT,&RP,BMP180_ADVRES);
		} else {
			printf("BMP180 check failed\r\n");
			while(1);
		}
	} else {
		printf("FAIL\r\n");
	}



	// Check the BMC050
	printf("eCompass ");
	if (I2Cx_IsDeviceReady(BMC050_I2C_PORT,BMC050_ACC_ADDR,10) == I2C_SUCCESS) {
		printf("ID: %02X\r\n",BMC050_ACC_GetDeviceID());
		BMC050_ACC_SoftReset();
		Delay_ms(5); // must wait for start-up time of accelerometer (2ms)
		BMC050_Init();

		// Enable I2C watchdog timer with 50ms
		BMC050_ACC_InterfaceConfig(ACC_IF_WDT_50ms);

		// Configure accelerometer
		BMC050_ACC_SetIRQ(ACC_IE_DISABLE); // Disable all interrupts
		BMC050_ACC_SetBandwidth(ACC_BW8); // Accelerometer readings filtering (lower or higher better?)
//		BMC050_ACC_SetIRQMode(ACC_IM_NOLATCH); // No IRQ latching
		BMC050_ACC_SetIRQMode(ACC_IM_500ms); // Temporary latch IRQ for 500ms
		BMC050_ACC_ConfigSlopeIRQ(3,4); // Motion detection sensitivity
		BMC050_ACC_IntPinMap(ACC_IM1_SLOPE); // Map slope interrupt to INT1 pin
		BMC050_ACC_SetIRQ(ACC_IE_SLOPEX | ACC_IE_SLOPEY | ACC_IE_SLOPEZ); // Detect motion by all axes
//		BMC050_ACC_LowPower(ACC_SLEEP_1000); // Low power with sleep duration 1s
		BMC050_ACC_LowPower(ACC_SLEEP_500); // Low power with sleep duration 500ms
//		BMC050_ACC_LowPower(ACC_SLEEP_1); // Low power with sleep duration 1ms
		BMC050_ACC_SetIRQMode(ACC_IM_RESET); // Clear IRQ bits

//		BMC050_ACC_Suspend();

		// Configure Accelerometer IRQ pin
		RCC->AHBENR |= ACC_IRQ_PERIPH; // Enable GPIO port peripheral

		// Configure GPIO pin as floating input (external pull-down)
		ACC_IRQ_PORT->MODER &= ~GPIO_MODER_MODER13; // Input mode (reset state)
		ACC_IRQ_PORT->PUPDR &= ~GPIO_PUPDR_PUPDR13; // Floating (clear bits)

		// Configure the EXTI line (Accelerometer IRQ pin)
		EXTI->PR    =  ACC_IRQ_EXTI; // Clear IT pending bit for EXTI
		EXTI->IMR  |=  ACC_IRQ_EXTI; // Enable interrupt request from EXTI
		EXTI->EMR  &= ~ACC_IRQ_EXTI; // Disable event on EXTI
		EXTI->RTSR |=  ACC_IRQ_EXTI; // Trigger rising edge enabled
		EXTI->FTSR |=  ACC_IRQ_EXTI; // Trigger falling edge enabled

		// PC13 as source input for EXTI13
		SYSCFG->EXTICR[3] &= ~SYSCFG_EXTICR4_EXTI13; // Clear bits (Set PCxx pin as input source)
		SYSCFG->EXTICR[3] |=  SYSCFG_EXTICR4_EXTI13_PC; // Set PCxx pin as input source

	/*
		// Enable the Accelerometer IRQ pin interrupt
		NVICInit.NVIC_IRQChannel = ACC_IRQ_EXTI_N;
		NVICInit.NVIC_IRQChannelPreemptionPriority = 2;
		NVICInit.NVIC_IRQChannelSubPriority = 0;
		NVICInit.NVIC_IRQChannelCmd = ENABLE;
		NVIC_Init(&NVICInit);
	*/

		// Simple enable the Accelerometer IRQ pin interrupt
		NVIC_EnableIRQ(ACC_IRQ_EXTI_N);
	} else {
		printf("FAIL\r\n");
	}




	// End of I2C devices test
    printf("---------------------------------------------\r\n");




	// Put MCU into STANDBY mode
//	PWR->CSR |= PWR_CSR_EWUP1; // Enable WKUP pin 1 (PA0)
//	PWR->CSR |= PWR_CSR_EWUP2; // Enable WKUP pin 2 (PC13)
//	SleepStop();
//	SleepStandby();
//	while(1);




	PWR_SD_ENABLE_H(); // Turn SD on

	// Enable the DMA2 peripheral clock
	RCC->AHBENR |= RCC_AHBENR_DMA2EN;

	// Enable the DMA2 channel4 interrupt
//	NVIC_EnableIRQ(DMA2_Channel4_IRQn);

	// Enable the SDIO interrupt
//	NVIC_EnableIRQ(SDIO_IRQn);

	if (_SD_connected) {
		SD_SDIO_GPIO_Init();
		j = SD_Init();
		printf("SD_Init: %X\r\n",j);
	} else j = SDR_NoResponse;
	_SD_last_state = _SD_connected;

