LonelyWolf/stm32/stm32l151rdt6-dev/main.c
	if (j == SDR_Success) {
		if (SDCard.Type != SDCT_MMC) {
			// MMC doesn't support 4-bit bus
			if (SDCard.SCR[1] & 0x05) {
				// Set 4-bit bus width
				SD_SetBusWidth(SD_BUS_4BIT);
			}
		}

		// DMA read block test
		for (i = 0; i < 2048; i++) sector[i] = '#';
		i = 2048; // block size
		j = SD_ReadBlock_DMA(0,(uint32_t *)sector,i);
		printf("SD_ReadBlock_DMA = %X\r\n",j);
		if (j == SDR_Success) {
			// Wait till data transfered by DMA
			j = SD_CheckRead(i);
			printf("SD_CheckRead = %X\r\n",j);
//			if (j == SDR_Success) VCP_SendBufPrintable(sector,i,'.');
//			printf("\r\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r\n");
		}

/*
		// DMA write block test
		for (i = 0; i < 512; i++) {
			sector[i] = sector[i + 1024] - 1;
			if (sector[i] < 33) sector[i] = 127;
			if (sector[i] > 127) sector[i] = 33;
		}
		for (i = 512; i < 1024; i++) {
			sector[i] = sector[i + 1024] + 1;
			if (sector[i] < 33) sector[i] = 127;
			if (sector[i] > 127) sector[i] = 33;
		}
//		j = SD_WriteBlock_DMA(1024,(uint32_t *)sector,2048);
		j = SD_WriteBlock_DMA(1024,(uint32_t *)sector,512);
		printf("SD_WriteBlock_DMA = %X\r\n",j);
		if (j == SDR_Success) {
			// Wait till data transfered by DMA
//			j = SD_CheckWrite(2048);
			j = SD_CheckWrite(512);
			printf("SD_CheckWrite = %X\r\n",j);
			if (j == SDR_Success) d0++; else d1++;
		} else d1++;
		j = SD_GetCardState(&sector[0]);
		printf("CardState = %X [%X]\r\n",sector[0],j);
	    printf("---------------------------------------------\r\n");
*/

/*
		// Write block test
		for (i = 0; i < 512; i++) sector[i] = '~';
		j = SD_WriteBlock(1024,(uint32_t *)sector,512);
		printf("Write block: %2X\r\n",j);
*/

///*
		// DMA read block test
		for (i = 0; i < 2048; i++) sector[i] = '#';
		i = 2048; // block size
		j = SD_ReadBlock_DMA(0,(uint32_t *)sector,i);
		printf("SD_ReadBlock_DMA = %X\r\n",j);
		if (j == SDR_Success) {
			// Wait till data transfered by DMA
			j = SD_CheckRead(i);
			printf("SD_CheckRead = %X\r\n",j);
//			if (j == SDR_Success) VCP_SendBufPrintable(sector,i,'.');
//			printf("\r\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r\n");
		}
//*/

/*
		// DMA read speed test
		d0 = 0; d1 = 0; k = 0; i = 0;
		printf("Started------>\r\n");
		do {
			j = SD_ReadBlock_DMA(0,(uint32_t *)sector,512);
			if (j == SDR_Success) {
				j = SD_CheckRead(512);
				if (j != SDR_Success) d0++;
			} else d1++;
			k += 512;
			i++;
		} while (k < 10485760); // 10MB read
//		} while (k < 104857600); // 100MB read
		printf("<--------Ended\r\n");
		printf("Failed: %u[%u] from %u\r\n",d0,d1,i);
	    printf("---------------------------------------------\r\n");
*/

//		while(1);

/*
		// Write block test
		for (i = 0; i < 1024; i++) sector[i] = '%';
		j = SD_WriteBlock(1024,(uint32_t *)sector,1024);
		for (i = 0; i < 2048; i++) sector[i] = '#';
		printf("Write block: %2X\r\n",j);
*/

/*
		// Read block speed test
		d0 = 0; k = 0; i = 0;
		printf("Started------>\r\n");
		do {
			j = SD_ReadBlock(0,(uint32_t *)sector,512);
			if (j != SDR_Success) d0++;
			k += 512;
			i++;
		} while (k < 10485760);
		printf("<--------Ended\r\n");
		printf("Failed: %u from %u\r\n",d0,i);
	    printf("---------------------------------------------\r\n");
*/




/*
		// Log file create test
		j = LOG_Init();
		printf("LOG_Init: #%u\r\n",j);
		if (j == LOG_OK) {
			i = 0;
			j = LOG_NewFile(&i);

			printf("LOG_NewFile: %X [#%u]\r\n",(unsigned int)j,i);

			if (j == LOG_OK) {
				LOG_WriteStr("WBC!\r\n");
				LOG_WriteStr("Shoop da whoop!\r\n");
				for (i = 0; i < 10000; i++) {
					LOG_WriteStr("CNTR=");
					LOG_WriteIntU(i);
					LOG_WriteStr("\r\n");
				}
				LOG_WriteStr("!WBC\r\n");
				LOG_FileSync();
			}
		}
*/

#ifdef NRF24_SOLAR
		// Log file create test
		j = LOG_Init();
		printf("LOG_Init: #%u\r\n",j);
		if (j == LOG_OK) {
			i = 0;
			j = LOG_NewFile(&i);

			printf("LOG_NewFile: %X [#%u]\r\n",(unsigned int)j,i);

			if (j == LOG_OK) {
				LOG_WriteStr("Solar temperature sensor\r\n");
				LOG_WriteStr("SENSOR_DATE;SENSOR_TIME;PACKET_NUM;TEMPERATURE;SENSOR_VBAT;SENSOR_LSI;SENSOR_OTX_LOST;SENSOR_OTX_RETRIES\r\n");
				LOG_FileSync();
				_logging = TRUE;
			}
		}
#endif


		// DOSFS test
		uint32_t pstart, psize, cfree;
		uint8_t pactive, ptype;
		VOLINFO vi;
		DIRINFO di;
		DIRENT de;
		uint32_t total_space;
		uint32_t free_space;
		uint32_t used_space;

		// Find partition start
		pstart = DFS_GetPtnStart(0,sector,0,&pactive,&ptype,&psize);
		if (pstart == DFS_ERRMISC) {
			printf("Cannot find first partition.\r\n");
		} else {
			printf("Partition start: %X [active: %u, type: %u]\r\n",pstart,pactive,ptype);
			printf("Size: %u sectors\r\n",psize);
		}

		if (DFS_GetVolInfo(0,sector,pstart,&vi)) {
			printf("Error getting volume information.\r\n");
		} else {
			printf("Volume label: \"%s\"\r\n",vi.label);
			printf("File system: ");
			if (vi.filesystem == FAT12)
				printf("FAT12\r\n");
			else if (vi.filesystem == FAT16)
				printf("FAT16\r\n");
			else if (vi.filesystem == FAT32)
				printf("FAT32\r\n");
			else
				printf("[unknown]\r\n");
			printf("Sector : %u bytes\r\n",vi.sectorsize);
			printf("Cluster: %u sectors [%u bytes]\r\n",vi.secperclus,vi.clustersize);
			printf("Volume : %u clusters [%u sectors]\r\n",vi.numclusters,vi.numsecs);

			i = DFS_GetFree(&vi,sector,&cfree);
			printf("Free   : %u clusters\r\n",cfree);

			total_space = vi.numclusters * vi.clustersize;
			free_space  = cfree * vi.clustersize;
			used_space  = (vi.numclusters - cfree) * vi.clustersize;

			printf("Used space: %10ub [%uMB]\r\n",used_space,used_space / 1048576);
			printf("Free space: %10ub [%uMB]\r\n",free_space,free_space / 1048576);
			printf("Capacity  : %10ub [%uMB]\r\n",total_space,total_space / 1048576);

			di.scratch = sector;

			// List files in root directory of SD card
			if (DFS_OpenDir(&vi,(uint8_t *)"",&di)) {
				printf("Error opening root directory.\r\n");
			} else {
				while (!DFS_GetNext(&vi,&di,&de)) {
					if (de.name[0]) {
						// Warning: there is no zero terminator in name
						printf("file: \"%s\" [%c%c%c%c%c] %10u\r\n",
								de.name,
								(de.attr & ATTR_DIRECTORY) ? 'D' : '-',
								(de.attr & ATTR_READ_ONLY) ? 'R' : '-',
								(de.attr & ATTR_HIDDEN)    ? 'H' : '-',
								(de.attr & ATTR_SYSTEM)    ? 'S' : '-',
								(de.attr & ATTR_ARCHIVE)   ? 'A' : '-',
								(de.filesize_3 << 24) | (de.filesize_2 << 16) | (de.filesize_1 << 8) | de.filesize_0);
					}
				}
			}

			// List files in LOG directory
			if (DFS_OpenDir(&vi,(uint8_t *)LOG_DIR_LOGS,&di)) {
				printf("Error opening \".\\%s\" directory.\r\n",LOG_DIR_LOGS);
			} else {
				while (!DFS_GetNext(&vi,&di,&de)) {
					if (de.name[0]) {
						// Warning: there is no zero terminator in name
						printf("file: \"%s\" [%c%c%c%c%c] %10u\r\n",
								de.name,
								(de.attr & ATTR_DIRECTORY) ? 'D' : '-',
								(de.attr & ATTR_READ_ONLY) ? 'R' : '-',
								(de.attr & ATTR_HIDDEN)    ? 'H' : '-',
								(de.attr & ATTR_SYSTEM)    ? 'S' : '-',
								(de.attr & ATTR_ARCHIVE)   ? 'A' : '-',
								(de.filesize_3 << 24) | (de.filesize_2 << 16) | (de.filesize_1 << 8) | de.filesize_0);
					}
				}
			}
		}

		// END OF SD CARD THESTS
	}




