LonelyWolf/stm32/stm32l151rdt6-dev/main.c
    printf("---------------------------------------------\r\n");




	BEEPER_Enable(2500,1);




	while(1) {
		// Date/time
		RTC_GetDateTime(&_time,&_date);
		printf("DTM: %s, %02u:%02u:%02u %02u.%02u.20%02u\r\n",
				sDOW[_date.RTC_WeekDay - 1],
				_time.RTC_Hours,
				_time.RTC_Minutes,
				_time.RTC_Seconds,
				_date.RTC_Date,
				_date.RTC_Month,
				_date.RTC_Year
			);

//		printf("BTN: #0 IDR=%s\r\n",(GPIOB->IDR & GPIO_Pin_10) ? "HI" : "LOW");
//		printf("BTN: #1 IDR=%s\r\n",(GPIOB->IDR & GPIO_Pin_11) ? "HI" : "LOW");
//		printf("BTN: #2 IDR=%s\r\n",(GPIOA->IDR & GPIO_Pin_15) ? "HI" : "LOW");
//		printf("BTN: #3 IDR=%s\r\n",(GPIOA->IDR & GPIO_Pin_0)  ? "HI" : "LOW");

		// Buttons
		for (i = 0; i < 4; i++) {
			printf("BTN: #%u CNTR=%u HOLD=%u STATE=%02X IDR=%s\r\n",
					i,
					BTN[i].cntr,
					BTN[i].hold_cntr,
					BTN[i].state,
					(BTN[i].PORT->IDR & BTN[i].PIN) ? "HI" : "LOW");
		}

		// Measure Vbat
/*
		// Do 16 ADC measurements and calculate rough average
		ADC1_raw = 0;
		Vrefint_raw = 0;
		for (i = 0; i < 16; i++) {
			ADC1->CR2 |= ADC_CR2_JSWSTART; // Start conversion of injected channels
			while (!(ADC1->SR & ADC_SR_JEOC)); // Wait until ADC conversions end
			ADC1_raw    += ADC1->JDR1; // Read injected data register1 (ADC_IN1)
			Vrefint_raw += ADC1->JDR2; // Read injected data register2 (ADC_IN17)
			if (i) {
				ADC1_raw >>= 1;
				Vrefint_raw >>= 1;
			}
			ADC1->SR &= ~ADC_SR_JEOC; // Clear JEOC bit (is this necessary?)
		}
*/

		// Do 16 ADC measurements
		for (i = 0; i < 16; i++) {
			ADC1->CR2 |= ADC_CR2_JSWSTART; // Start conversion of injected channels
			while (!(ADC1->SR & ADC_SR_JEOC)); // Wait until ADC conversions end
			ADC1_raws[i]    = ADC1->JDR1; // Read injected data register1 (ADC_IN1)
			Vrefint_raws[i] = ADC1->JDR2; // Read injected data register2 (ADC_IN17)
		}
		// Calculate interquartile mean values of ADC readings
		ADC1_raw = InterquartileMean(ADC1_raws,16);
		Vrefint_raw = InterquartileMean(Vrefint_raws,16);

		// Convert ADC readings to voltage
		Vbat = (uint16_t)(((*VREFINT_CAL * ADC1_raw * 3.0)/(Vrefint_raw * 4095.0)) * 1000);
		Vrefint = (uint16_t)(((Vrefint_raw * 3.0) / 4095.0) * 1000);
		Vcpu = (uint16_t)(((*VREFINT_CAL * 3.0) / Vrefint_raw) * 1000);
		printf("VOL: Bat=[%u.%03uV -> %u.%03uV] Ref=%u.%03uV CPU=%u.%03uV\r\n",
				(unsigned int)Vbat / 1000, (unsigned int)Vbat % 1000,
				((unsigned int)Vbat / 1000) * 2, ((unsigned int)Vbat % 1000) * 2,
				(unsigned int)Vrefint / 1000, (unsigned int)Vrefint % 1000,
				(unsigned int)Vcpu / 1000, (unsigned int)Vcpu % 1000);

		// Get ALS readings
		d0 = TSL2581_GetData0();
		d1 = TSL2581_GetData1();
		printf("ALS: D0=%u D1=%u\r\n", (unsigned int)d0, (unsigned int)d1);

		// Get accelerometer readings
		BMC050_ACC_GetXYZ(&X,&Y,&Z);
		ACCT = BMC050_ReadTemp();
		printf("ACC: X=%d Y=%d Z=%d T=%d.%dC\r\n", X, Y, Z, ACCT / 10, ACCT % 10);

		// Get barometer readings
		BR = BMP180_GetReadings(&RT,&RP,BMP180_ADVRES);
		if (BR == BMP180_SUCCESS) {
			RP = BMP180_hPa_to_mmHg(RP);
			printf("BAR: T=%d.%dC P=%u.%ummHg\r\n", RT / 10, RT % 10, (unsigned int)RP / 10, (unsigned int)RP % 10);
		} else {
			printf("BAR: failed\r\n");
		}

		// USB sense pin state
		printf("USB: %s (%d)\r\n",_USB_connected ? "connected" : "disconnected",(unsigned int)_USB_int_cntr);
/*
		if (_USB_connected) {
			BEEPER_Enable(4444,1);
			// USB cable plugged
			if (bDeviceState != CONFIGURED) {
				// USB device is not configured, try to initialize it
				USBdev_Init();
			}
		} else {
			// USB cable unplugged
			if (bDeviceState == CONFIGURED) {
				// USB device is configured, deinitialize it
				PowerOff();
				bDeviceState = UNCONNECTED;
				pInformation->Current_Configuration = 0;
			}
		}
*/

		// Get charger STAT pin state
		i = 0;
		CHRG_STAT_PORT->PUPDR &= ~GPIO_PUPDR_PUPDR2; // Floating (clear bits)
		Delay_ms(100);
		printf("CHG: NONE=%d ",(unsigned int)(CHRG_STAT_PORT->IDR & CHRG_STAT_PIN));
		if (CHRG_STAT_PORT->IDR & CHRG_STAT_PIN) i++;

		CHRG_STAT_PORT->PUPDR &= ~GPIO_PUPDR_PUPDR2; // Floating (clear bits)
		CHRG_STAT_PORT->PUPDR |=  GPIO_PUPDR_PUPDR2_1; // Pull-down
		Delay_ms(100);
		printf("PD=%d ",(unsigned int)(CHRG_STAT_PORT->IDR & CHRG_STAT_PIN));
		if (CHRG_STAT_PORT->IDR & CHRG_STAT_PIN) i++;

		CHRG_STAT_PORT->PUPDR &= ~GPIO_PUPDR_PUPDR2; // Floating (clear bits)
		CHRG_STAT_PORT->PUPDR |=  GPIO_PUPDR_PUPDR2_0; // Pull-up
		Delay_ms(100);
		printf("PU=%d\r\n",(unsigned int)(CHRG_STAT_PORT->IDR & CHRG_STAT_PIN));

		CHRG_STAT_PORT->PUPDR &= ~GPIO_PUPDR_PUPDR2; // Floating (clear bits)

		// SD card state
		printf("SDC: %s (%d)\r\n",_SD_connected ? "present" : "no card",(unsigned int)_SD_int_cntr);
		if (_SD_last_state != _SD_connected) {
			if (_SD_connected) {
				// The SD card was inserted, need to initialize it
				j = SD_Init();
				printf("SD_Init: %X\r\n",j);
				if ((j == SDR_Success) && (SDCard.Type != SDCT_MMC)) {
					// MMC doesn't support 4-bit bus
					if (SDCard.SCR[1] & 0x05) SD_SetBusWidth(SD_BUS_4BIT);
				}
			}
		}
		_SD_last_state = _SD_connected;

		// Read some blocks from the SD card
		if (_SD_connected) {
/*
			for (i = 0; i < 2048; ) sector[i++] = '#';
			j = SD_ReadBlock(0,(uint32_t *)sector,2048);
			printf("SD_ReadBlock = %02X, ",j);
			if (j != SDR_Success) BEEPER_Enable(1111,1);
			j = SD_GetCardState(&sector[0]);
			printf("SD_GetCardState = %02X [%X]\r\n",j,sector[0]);
*/
			for (i = 0; i < 2048; ) sector[i++] = '#';
			j = SD_ReadBlock_DMA(0,(uint32_t *)sector,2048);
			printf("ReadBlock_DMA = %02X, ",j);
			if (j == SDR_Success) {
				j = SD_CheckRead(2048);
				printf("CheckRead = %02X, ",j);
			}
			if (j != SDR_Success) BEEPER_Enable(4444,1);

			j = SD_GetCardState(&sector[0]);
			printf("CardState = %02X [%X]\r\n",j,sector[0]);
		}

#ifdef NRF24_SOLAR
		// Yep, the following code is so ugly =)

		// Solar temperature sensor packet
		printf("NRF: %upkts%s",_packets_rcvd,(_new_packet) ? " " : "\r\n");
		if (_new_packet) {
			RT = (nRF24_RX_Buf[0] << 8) | nRF24_RX_Buf[1]; // Temperature
			Vrefint = (nRF24_RX_Buf[6] << 8) + nRF24_RX_Buf[7]; // Sensor voltage
			printf("[#%u TEMP: %d.%dC VREF: %u.%uV LSI: %uHz OTX: %u/%u %02u:%02u:%02u %02u.%02u.20%02u]\r\n",
					(uint32_t)((nRF24_RX_Buf[2] << 24)|(nRF24_RX_Buf[3] << 16)|(nRF24_RX_Buf[4] << 8)|(nRF24_RX_Buf[5])), /* Packet number */
					RT / 10, RT % 10,
					Vrefint / 100, Vrefint % 100,
					(nRF24_RX_Buf[14] << 8) + nRF24_RX_Buf[15], /* Sensor MCU LSI frequency */
					nRF24_RX_Buf[16] >> 4, nRF24_RX_Buf[16] & 0x0F, /* Sensor nRF24 OTX register: lost packets/number of retries */
					(((nRF24_RX_Buf[10] & 0x30) >> 4) * 10) + (nRF24_RX_Buf[10] & 0x0F), /* Time: hours */
					((nRF24_RX_Buf[9] >> 4) * 10) + (nRF24_RX_Buf[9] & 0x0F), /* Time: minutes */
					((nRF24_RX_Buf[8] >> 4) * 10) + (nRF24_RX_Buf[8] & 0x0F), /* Time: seconds */
					((nRF24_RX_Buf[11] >> 4) * 10) + (nRF24_RX_Buf[11] & 0x0F), /* Date: day */
					(((nRF24_RX_Buf[12] & 0x1f) >> 4) * 10) + (nRF24_RX_Buf[12] & 0x0F), /* Date: month */
					((nRF24_RX_Buf[13] >> 4) * 10) + (nRF24_RX_Buf[13] & 0x0F) /* Date: year */
					);

			// Write data to log file
			if (_logging) {
				// Sensor time
				LOG_WriteTime(
						(((nRF24_RX_Buf[10] & 0x30) >> 4) * 10) + (nRF24_RX_Buf[10] & 0x0F),
						((nRF24_RX_Buf[9] >> 4) * 10) + (nRF24_RX_Buf[9] & 0x0F),
						((nRF24_RX_Buf[8] >> 4) * 10) + (nRF24_RX_Buf[8] & 0x0F));
				LOG_WriteStr(";");
				// Sensor date
				LOG_WriteDate(
						((nRF24_RX_Buf[11] >> 4) * 10) + (nRF24_RX_Buf[11] & 0x0F),
						(((nRF24_RX_Buf[12] & 0x1f) >> 4) * 10) + (nRF24_RX_Buf[12] & 0x0F),
						((nRF24_RX_Buf[13] >> 4) * 10) + (nRF24_RX_Buf[13] & 0x0F));
				LOG_WriteStr(";");
				// Packet number
				LOG_WriteIntU((uint32_t)((nRF24_RX_Buf[2] << 24)|(nRF24_RX_Buf[3] << 16)|(nRF24_RX_Buf[4] << 8)|(nRF24_RX_Buf[5])));
				LOG_WriteStr(";");
				// Temperature
				LOG_WriteInt(RT / 10);
				LOG_WriteStr(".");
				LOG_WriteInt(RT % 10);
				LOG_WriteStr("C;");
				// Sensor voltage
				LOG_WriteIntF(Vrefint,2);
				LOG_WriteStr("V;");
				// Sensor MCU LSI frequency
				LOG_WriteIntU((nRF24_RX_Buf[14] << 8) + nRF24_RX_Buf[15]);
				LOG_WriteStr("Hz;");
				// Sensor nRF24 OTX register (shockburst)
				LOG_WriteIntU(nRF24_RX_Buf[16] >> 4); // Lost packets
				LOG_WriteStr(";");
				LOG_WriteIntU(nRF24_RX_Buf[16] & 0x0F); // Number of retries
				LOG_WriteStr("\r\n");
				LOG_FileSync(); // Save data buffer to SD card
			}

			_new_packet = FALSE;
		}
#else
		// WBC packet
		printf("NRF: %upkts%s",_packets_rcvd,(_new_packet) ? " " : "\r\n");
		if (_new_packet) {
			i = CRC8_CCITT(nRF24_RX_Buf,nRF24_RX_PAYLOAD - 1);
			j = ((nRF24_RX_Buf[6] & 0x03) << 8) + nRF24_RX_Buf[7];
			printf("[CRC: %02X%c%02X VBAT: %u.%uV WAKE: %u]\r\n",
					i,(i == nRF24_RX_Buf[nRF24_RX_PAYLOAD - 1]) ? '=' : '!',nRF24_RX_Buf[nRF24_RX_PAYLOAD - 1],
					j / 100, j % 100,
					(nRF24_RX_Buf[8] << 8) + nRF24_RX_Buf[9]);
			_new_packet = FALSE;
		}
#endif

		i = BMC050_ACC_GetIRQStatus();
		printf("ACC: %s [%04X]\r\n",(ACC_IRQ_PORT->IDR & ACC_IRQ_PIN) ? "HIGH" : "LOW",i);
//		BMC050_ACC_SetIRQMode(ACC_IM_RESET); // Clear IRQ bits

	    printf("---------------------------------------------\r\n");

//		BEEPER_Enable(111,1);

//		Delay_ms(2000);

	    // Put MCU into SLEEP mode
//		SleepWait();

	    // Put MCU into STOP mode
//	    SleepStop();

		// Put MCU into STANDBY mode
//		PWR->CSR |= PWR_CSR_EWUP1; // Enable WKUP pin 1 (PA0)
//		PWR->CSR |= PWR_CSR_EWUP2; // Enable WKUP pin 2 (PC13)
//		SleepStandby();

	    if (BTN[BTN_UP].state == BTN_Pressed) {
	    	BEEPER_PlayTones(tones_3beep);
	    	while(_tones_playing);
	    	RTC_SetWakeUp(0); // Disable RTC wake-up
	    	PWR->CSR |= PWR_CSR_EWUP1; // Enable WKUP pin 1 (PA0)
	    	PWR->CSR |= PWR_CSR_EWUP2; // Enable WKUP pin 2 (PC13)
	    	SleepStandby();
	    } else {
	    	SleepWait();
	    }
	}




	// Put MCU into STANDBY mode
	PWR->CSR |= PWR_CSR_EWUP1; // Enable WKUP pin 1 (PA0)
	PWR->CSR |= PWR_CSR_EWUP2; // Enable WKUP pin 2 (PC13)
	SleepStandby();

	// After STANDBY the MCU will go RESET routine, not here
	while(1);
}
